## 판다스 (Pandas)

- 핵심객체는 DataFrame이다
- 데이타프레임은 2차원 데이터 구조체로 넘파이보다 편리하게 데이타 핸들링한다.
- R 언어의 데이타 프레임과 비슷하고 많이 사용된다


#### DataFrame 에서 데이타 필터링 ( 추출하기 )

0. 맨처음에는

    + df[2] : 2행의 데이타 추출
    + df['A'] : A열(컬럼) 데이타 추출
    
    + df[n:m] : n번째부터 m-1번째까지의 행 추출
        
        ` 행과 열을 섞어서 추출함.
        
        ` 판다스를 만든 사람이 쓴 책의 번역서를 보면 이 부분을 후회한다고 나옴
        
        ` df[2] 이 형식은 에러 발생 ( 2021.01)
      

1. 열(컬럼) 추출

    + df.컬럼명
    + df['컬럼명']
       
    
2. 행 추출

    + df.loc[] : 인덱스 지정하지 않으면 인덱스(순서), 인덱스 지정하면 인덱스로 추출
    + df.iloc[] : 인덱스(순서)로 추출

    [참고] 
    
    - 위 3 연산자는 노련한 개발자들도 혼동하기에, 일반적으로 하나만 선택해서 사용하는 것을 권장한단다
    - 넘파이와 유사한 부분으로 더우 혼동하기 쉽다
    - 판다스의 DataFrame와 Series에서도 다른이 있어서 주의해야 한다
    
    
3. 행과 열에서 추출
    
    + df.loc[2, 3] : 2 행의 3열 데이타
    + df.loc[1:3, 2:4] : 1부터 3행전까지의 행에서 2부터 4전까지의 열의 데이타

In [2]:
import pandas as pd

# 데이타 프레임 자료 생성
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

df = pd.DataFrame(mydata)

print(type(mydata))
print(type(df))

df

<class 'dict'>
<class 'pandas.core.frame.DataFrame'>

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [6]:
#열추출
print(df.name)
# df['컬럼명']
print(df['name'])

#행추출
print(df.loc[1])
print(df.iloc[1])

0    홍길동
1    박길동
2    김길동
Name: name, dtype: object
0    홍길동
1    박길동
2    김길동
Name: name, dtype: object
name    박길동
age      33
dept     국어
Name: 1, dtype: object
name    박길동
age      33
dept     국어
Name: 1, dtype: object

In [11]:
df = pd.DataFrame(mydata, index=['일','이','삼'])
df

print(df.loc['이'])

name    박길동
age      33
dept     국어
Name: 이, dtype: object

In [12]:
df.index

Index(['일', '이', '삼'], dtype='object')

In [13]:
df.values

array([['홍길동', 22, '컴공'],
       ['박길동', 33, '국어'],
       ['김길동', 44, '산업']], dtype=object)

In [15]:
df.columns

Index(['name', 'age', 'dept'], dtype='object')

In [21]:
# '박길동'
print(df.loc['이'].values[0])

박길동

### 컬럼 추가, 행 추가

In [23]:
# 컬럼 추가
df['gender'] = ['여자','여자','남자']
df

  name  age dept gender
일  홍길동   22   컴공     여자
이  박길동   33   국어     여자
삼  김길동   44   산업     남자

In [24]:
# 행 추가
df.loc[3] = ['이길동','33','컴공','남자']
df

  name age dept gender
일  홍길동  22   컴공     여자
이  박길동  33   국어     여자
삼  김길동  44   산업     남자
3  이길동  33   컴공     남자

In [27]:
# 행 추가
df.loc['사'] = ['장길동2','33','컴공','남자'] # [index] = [value] , #같은 index 로 하면 수정이 됨
df

   name age dept gender
일   홍길동  22   컴공     여자
이   박길동  33   국어     여자
삼   김길동  44   산업     남자
3   이길동  33   컴공     남자
9   장길동  33   컴공     남자
사  장길동2  33   컴공     남자

### 변경

In [47]:
# 인덱스순서를 변경하려면 -> 인덱스는 우선 DataFrame이 있는 상태에서 변경해야 한다
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

df = pd.DataFrame(mydata)
print(df)
df2 =df.reindex([1,0,2]) #index값을 새로 변경
print(df2)

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업
  name  age dept
1  박길동   33   국어
0  홍길동   22   컴공
2  김길동   44   산업

In [31]:
# 컬럼연산
df['age+10'] = df['age'] + 10
df

  name  age dept  age+10
0  홍길동   22   컴공      32
1  박길동   33   국어      43
2  김길동   44   산업      54

In [54]:
# 2행에 'dept'열의 값을 '인문'으로 변경
#df.dept.iloc[2] = '인문' 
#df.loc[2,'deft'] = '인문' -pick
#df.dept[2] = '인문'
#df.loc[2] = ['김길동',44,'인문',54]

C:\Users\xorms\anaconda3\lib\site-packages\pandas\core\indexing.py:1637: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

  name  age dept
0  홍길동   22   컴공
1  박길동   33   인문
2  김길동   44   산업

###  컬럼 속성 추출

In [8]:
# 컬럼 속성 추출
df.컬럼명
df['컬럼명']

In [9]:
# 특정 컬럼의 특정행 추출 -> 즉 특정셀 추출 (2번 인덱스의 dept 컬럼값은? )

In [78]:
# 30세 이상의 레코드 검색
df[df.age >= 30]

  name  age dept
1  박길동   33   인문
2  김길동   44   산업

In [11]:
# 인덱스 1의 name 값을 '맹길동'로 변경하려면?

## 데이타 필터링

- 넘파이와 유사한 부분으로 더우 혼동하기 쉽다

- 판다스의 DataFrame와 Series에서도 다른 부분이 있어서 주의해야 한다


1. loc[] : 인덱스와 명칭으로 추출

2. iloc[] : 인덱스로 추출

3. ix[] : 명치 기반 인덱싱과 위치 기반 인덱싱 모두 사용 (*  그러나 곧 사라질 예정 )


위 3 연산자는 노련한 개발자들도 혼동하기에,
일반적으로 하나만 선택해서 사용하는 것을 권장한단다

In [98]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

df = pd.DataFrame(mydata, index= ['일','이','삼'])

In [82]:
# 명칭기반 인덱스 : 문자열이 인덱스인 경우
print(df.loc[1]) # loc는 써있는 숫자를 따라감
print(df.iloc[1]) # iloc은 진짜 0,1,2 번째의 index

name    박길동
age      33
dept     국어
Name: 1, dtype: object
name    박길동
age      33
dept     국어
Name: 1, dtype: object

In [88]:
print(df)
print(df.loc['일']) 
#print(df.iloc['일']) -> 에러 #진짜 index 0,1~ 값이기 때문

  name  age dept
일  홍길동   22   컴공
이  박길동   33   국어
삼  김길동   44   산업
name    홍길동
age      22
dept     컴공
Name: 일, dtype: object

In [93]:
df.loc[['일','삼']] #2차원배열 아님
df[['name','dept']]

  name dept
일  홍길동   컴공
이  박길동   국어
삼  김길동   산업

In [95]:
# 특정 컬럼으로 인덱스를 지정
df2=df.set_index('name',inplace=True) #inplace=True ->원본을 변경하겠다.
df2

      age dept
name
홍길동    22   컴공
박길동    33   국어
김길동    44   산업

In [96]:
df #원본은 바꾸지않음

  name  age dept
일  홍길동   22   컴공
이  박길동   33   국어
삼  김길동   44   산업

### 정렬과 T

In [106]:
# 나이를 오름차순으로
# df.sort_index(ascending=0)   # 인덱스 정렬 기본값이 ascending=1

df.sort_index(ascending=False) # index 값으로정렬

df.sort_values('name', ascending=False, inplace=True) #values 값으로정렬 #inplace 값은 기본적으로 False로 원본값 변경이 안된다.


# 전문가들은 원본이 변경하지 않는 것을 권장

  name  age dept
일  홍길동   22   컴공
이  박길동   33   국어
삼  김길동   44   산업

In [107]:
# 행,열 바꾸기

df.T

        일    이    삼
name  홍길동  박길동  김길동
age    22   33   44
dept   컴공   국어   산업

### 정보확인

In [108]:
# 총 데이터 건수와 데이타 타입등 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 일 to 삼
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
 2   dept    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [111]:
# 기본통계량 구하기 ( 총개수, 평균, 표준편차, 최소값, 4분위수 등)

df.describe() #숫자로 이루어진 컬럼만 딱 계산해줌

        age
count   3.0
mean   33.0
std    11.0
min    22.0
25%    27.5
50%    33.0
75%    38.5
max    44.0